# 계단수
# https://www.acmicpc.net/problem/10844
N = int(input())
D = [[0] * 10] * (N+1)
D[1] = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1]

# D[N][H] : N자리의 마지막에서 H로 끝나는 계단수
for i in range(2, N+1):
    D[i][0] = D[i-1][1]
    D[i][1] = D[i-1][0] + D[i-1][2]
    D[i][2] = D[i-1][1] + D[i-1][3]
    D[i][3] = D[i-1][2] + D[i-1][4]
    D[i][4] = D[i-1][3] + D[i-1][5]
    D[i][5] = D[i-1][4] + D[i-1][6]
    D[i][6] = D[i-1][5] + D[i-1][7]
    D[i][7] = D[i-1][6] + D[i-1][8]
    D[i][8] = D[i-1][7] + D[i-1][9]
    D[i][9] = D[i-1][8]

print(sum(D[N]))